package com.bwjf.createpdf.test;

import java.security.MessageDigest;

/**
 * MD5技术加密解密
 */
public class MD5Tools {
    /***
     * MD5加码 生成32位md5码
     */
    public static String string2MD5(String inStr){
        MessageDigest md5 = null;
        try{
            md5 = MessageDigest.getInstance("MD5");
        }catch (Exception e){
            System.out.println(e.toString());
            e.printStackTrace();
            return "";
        }
        char[] charArray = inStr.toCharArray();
        byte[] byteArray = new byte[charArray.length];

        for (int i = 0; i < charArray.length; i++)
            byteArray[i] = (byte) charArray[i];
        byte[] md5Bytes = md5.digest(byteArray);
        StringBuffer hexValue = new StringBuffer();
        for (int i = 0; i < md5Bytes.length; i++){
            int val = ((int) md5Bytes[i]) & 0xff;
            if (val < 16)
                hexValue.append("0");
            hexValue.append(Integer.toHexString(val));
        }
        return hexValue.toString();

    }

    /**
     * 加密解密算法 执行一次加密，两次解密
     */
    public static String convertMD5(String inStr){

        char[] a = inStr.toCharArray();
        for (int i = 0; i < a.length; i++){
            a[i] = (char) (a[i] ^ 't');
        }
        String s = new String(a);
        return s;

    }

    // 测试主函数
    public static void main(String args[]) {
//        String s = new String("\"{\\n\" +\n" +
//                "                \"    \\\"access_token\\\": \\\"acdc73ec1ad145fbbfbc2dfddd0c7372b5d9e04f0e8043f5b3a64e920d96b083\\\",\\n\" +\n" +
//                "                \"    \\\"serviceKey\\\": \\\"bwjf_InvoiceHandle_newBlueInvoice\\\",\\n\" +\n" +
//                "                \"    \\\"data\\\": \\n\" +\n" +
//                "                \"    {\\n\" +\n" +
//                "                \"    \\\"data_resources\\\": \\\"API\\\",\\n\" +\n" +
//                "                \"    \\\"nsrsbh\\\": \\\"91320106598035469W\\\",\\n\" +\n" +
//                "                \"    \\\"skph\\\":\\\"123213123212\\\",\\n\" +\n" +
//                "                \"    \\\"order_num\\\": \\\"iHkml3V154806120830\\\",\\n\" +\n" +
//                "                \"    \\\"bmb_bbh\\\": \\\"32.0\\\",\\n\" +\n" +
//                "                \"    \\\"zsfs\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"    \\\"tspz\\\":\\\"00\\\",\\n\" +\n" +
//                "                \"    \\\"xsf_nsrsbh\\\": \\\"91320106598035469W\\\",\\n\" +\n" +
//                "                \"    \\\"xsf_mc\\\": \\\"江苏百旺金赋信息科技有限公司\\\",\\n\" +\n" +
//                "                \"    \\\"xsf_dzdh\\\": \\\"城市区人民中路188号飞驰新天地广场2幢1801室0515-88196558\\\",\\n\" +\n" +
//                "                \"    \\\"xsf_yhzh\\\": \\\"中国建设银行迎宾支行32050173513609916688\\\",\\n\" +\n" +
//                "                \"    \\\"gmf_nsrsbh\\\": \\\"913201022498209112\\\",\\n\" +\n" +
//                "                \"    \\\"gmf_mc\\\": \\\"测试用户0425\\\",\\n\" +\n" +
//                "                \"    \\\"gmf_dzdh\\\": \\\"崔老板的300平米豪宅110\\\",\\n\" +\n" +
//                "                \"    \\\"gmf_yhzh\\\": \\\"中国崔氏银行0000\\\",\\n\" +\n" +
//                "                \"    \\\"kpr\\\": \\\"崔老板111\\\",\\n\" +\n" +
//                "                \"    \\\"skr\\\": \\\"红字skr\\\",\\n\" +\n" +
//                "                \"    \\\"fhr\\\": \\\"红字fhr\\\", \\n\" +\n" +
//                "                \"    \\\"yfp_dm\\\": \\\"150007899605\\\",\\n\" +\n" +
//                "                \"    \\\"yfp_hm\\\": \\\"65439448\\\",\\n\" +\n" +
//                "                \"    \\\"jshj\\\": \\\"280.00\\\",\\n\" +\n" +
//                "                \"    \\\"hjje\\\": \\\"264.15\\\",\\n\" +\n" +
//                "                \"    \\\"hjse\\\": \\\"15.85\\\",\\n\" +\n" +
//                "                \"    \\\"kce\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"    \\\"bz\\\": \\\"服务费截止时间：2019.4.27-2020.4.27\\\",\\n\" +\n" +
//                "                \"    \\\"jff_phone\\\":\\\"手机号\\\",\\n\" +\n" +
//                "                \"    \\\"jff_email\\\":\\\"电子邮件\\\",\\n\" +\n" +
//                "                \"    \\\"common_fpkj_xmxx\\\": [{\\n\" +\n" +
//                "                \"            \\\"fphxz\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"spbm\\\": \\\"3079900000000000000\\\",\\n\" +\n" +
//                "                \"            \\\"zxbm\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"yhzcbs\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"lslbs\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"zzstsgl\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmmc\\\": \\\"税控系统技术维护费\\\",\\n\" +\n" +
//                "                \"            \\\"ggxh\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"dw\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmsl\\\": \\\"1.000000\\\",\\n\" +\n" +
//                "                \"            \\\"xmdj\\\": \\\"174.523654125654\\\",\\n\" +\n" +
//                "                \"            \\\"xmje\\\": \\\"174.52\\\",\\n\" +\n" +
//                "                \"            \\\"sl\\\": \\\"0.06\\\",\\n\" +\n" +
//                "                \"            \\\"se\\\": \\\"15.85\\\"\\n\" +\n" +
//                "                \"        },\\n\" +\n" +
//                "                \"\\t\\t{\\n\" +\n" +
//                "                \"            \\\"fphxz\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"spbm\\\": \\\"3079900000000000000\\\",\\n\" +\n" +
//                "                \"            \\\"zxbm\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"yhzcbs\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"lslbs\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"zzstsgl\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmmc\\\": \\\"税控系统技术维护费2\\\",\\n\" +\n" +
//                "                \"            \\\"ggxh\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"dw\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmsl\\\": \\\"3.000000\\\",\\n\" +\n" +
//                "                \"            \\\"xmdj\\\": \\\"316.88\\\",\\n\" +\n" +
//                "                \"            \\\"xmje\\\": \\\"950.64\\\",\\n\" +\n" +
//                "                \"            \\\"sl\\\": \\\"0.06\\\",\\n\" +\n" +
//                "                \"            \\\"se\\\": \\\"15.85\\\"\\n\" +\n" +
//                "                \"        },{\\n\" +\n" +
//                "                \"            \\\"fphxz\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"spbm\\\": \\\"3079900000000000000\\\",\\n\" +\n" +
//                "                \"            \\\"zxbm\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"yhzcbs\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"lslbs\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"zzstsgl\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmmc\\\": \\\"税控系统技术维护费3\\\",\\n\" +\n" +
//                "                \"            \\\"ggxh\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"dw\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmsl\\\": \\\"2.000000\\\",\\n\" +\n" +
//                "                \"            \\\"xmdj\\\": \\\"450.00\\\",\\n\" +\n" +
//                "                \"            \\\"xmje\\\": \\\"900.00\\\",\\n\" +\n" +
//                "                \"            \\\"sl\\\": \\\"0.06\\\",\\n\" +\n" +
//                "                \"            \\\"se\\\": \\\"15.85\\\"\\n\" +\n" +
//                "                \"        },{\\n\" +\n" +
//                "                \"            \\\"fphxz\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"spbm\\\": \\\"3079900000000000000\\\",\\n\" +\n" +
//                "                \"            \\\"zxbm\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"yhzcbs\\\": \\\"0\\\",\\n\" +\n" +
//                "                \"            \\\"lslbs\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"zzstsgl\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmmc\\\": \\\"税控系统技术维护费4\\\",\\n\" +\n" +
//                "                \"            \\\"ggxh\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"dw\\\": \\\"\\\",\\n\" +\n" +
//                "                \"            \\\"xmsl\\\": \\\"1.000000\\\",\\n\" +\n" +
//                "                \"            \\\"xmdj\\\": \\\"206.236545879651\\\",\\n\" +\n" +
//                "                \"            \\\"xmje\\\": \\\"206.24\\\",\\n\" +\n" +
//                "                \"            \\\"sl\\\": \\\"0.06\\\",\\n\" +\n" +
//                "                \"            \\\"se\\\": \\\"15.85\\\"\\n\" +\n" +
//                "                \"        }]\\n\" +\n" +
//                "                \"    }\\n\" +\n" +
//                "                \"}\"");
//        System.out.println("原始：" + s);
        String s  = "123";
        System.out.println("MD5后：" + string2MD5(s));
        System.out.println("加密的：" + convertMD5(s));
//        System.out.println("解密的：" + convertMD5(convertMD5(s)));

    }
}